#+ORG2BLOG:
#+BLOG: wisdomandwonder
#+POSTID: 10652
#+DATE: [2017-08-08 Tue 20:20]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Article
#+TAGS: Programming Language, Go Lang, GBEN
#+TITLE: (Go Lang) GBEN: Hello World

[[https://gobyexample.com/hello-world][Go by Example: Hello World]]

* Example
:PROPERTIES:
:ID:       org_gcr_2017-08-08_mara:33B2158C-BC69-4D0B-9853-C0284A0EC605
:END:
Go has first class Unicode support. What do upper-case and lower-case mean
when there is no such thing for the character? Does it fail with an error or
not? How do you compare the size or length of Unicode characters?

#+NAME: hello-world
#+BEGIN_SRC go :imports '("fmt") :results output
fmt.Println("🐃 Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo ")
#+END_SRC

#+RESULTS: hello-world
#+BEGIN_EXAMPLE
🐃 Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo
#+END_EXAMPLE

[[https://www.wisdomandwonder.com/article/10651/go-lang-go-by-example-notes-gben][Attribution]]
